{
	"schemaVersion": 1,
	"id": "champions",
	"version": "${version}",
	"name": "Champions",
	"description": "Champions adds elite mobs champions to the game with enhanced stats, unique abilities affixes, and extra loot. Any hostile mob can become a champion. The mod is highly customizable via config, allowing players to balance difficulty.\n§eAdaptable§r - Champion will take less and less damage from the same consecutive damage type\n§bArctic§r - Continuously fires homing projectiles that will slow anyone they hit\n§dDampening§r - Reduces the damage of indirect attacks\n§4Desecrating§r - Periodically spawns a cloud of harming underneath its target\n§eHasty§r - Drastically increases movement speed\n§2Infested§r - Attacking and being attacked will spawn silverfish that will attack its target\n§3Knocking§r - Increased knockback from attacks, which will also slow targets for a small period of time\n§cLively§r - Regenerates 1 health per second. This increases to 5 health per second when not attacking or pursuing any targets.\n§6Molten§r - Continuously fires homing projectiles that will damage and burn anyone they hit and grants fire resistance\n§eMagnetic§r - Periodically pulls targets towards itself\n§8Paralyzing§r - Small chance per attack to \"jail\" targets, making them unable to move positions for a few seconds\n§8Blinded§r - You have a chance to be Blinded for couple of seconds when a champion attacks you and hits you\n§2Plagued§r - Infects nearby creatures with a Poison effect\n§5Reflective§r - A small portion of damage is reflected back at the attacker\n§fShielding§r - Periodically shields itself from all damage",
	"authors": [
		"Crystal"
	],
	"contact": {
		"homepage": "https://modrinth.com/project/champions-fabric",
		"sources": "https://github.com/crystalx375/Champions",
        "issues": "https://github.com/crystalx375/Champions/issues"
	},
	"license": "Gplv3",
	"icon": "assets/champions/icon.png",
	"environment": "*",
	"entrypoints": {
		"main": [
			"crystal.champions.Champions",
          "crystal.champions.data.ChampionsLootTableRegister"
		],
        "fabric-datagen": [
          "crystal.champions.data.DataGenerator"
        ],
		"client": [
          "crystal.champions.client.ChampionsClient"
		]
	},
	"mixins": [
		"champions.mixins.json",
        "champions.mixins.affixes.json",
		{
			"config": "champions.client.mixins.json",
			"environment": "client"
		}
	],
	"depends": {
		"fabricloader": ">=0.16.10",
		"minecraft": ">=1.20 <=1.20.4",
		"java": ">=17",
		"fabric-api": "*"
	}
}